For this practice different file sources were used, both csv and xlsx formats. The first thing we did was save them in csv format and if possible in utf8.

In [4]:
import pandas as pd
import os

In [5]:
ruta = os.path.abspath('..')

$$CanalDeVenta.csv$$

In [9]:
archive = pd.read_csv(ruta+'/data/CanalDeVenta.csv', sep=';')
archive.head(3)

   CODIGO DESCRIPCION
0       1  Telefónica
1       2      OnLine
2       3  Presencial

The table contains 2 fields

$$Clientes.csv$$

In [11]:
archive = pd.read_csv(ruta+'/data/Clientes.csv', sep=';')
archive.head(3)

,ID,Provincia,Nombre_y_Apellido,Domicilio,Telefono,Edad,Localidad,X,Y,col10
0,1,Buenos Aires,HEBER JONI SANTANA,LAS HERAS Y BAT. 24 DE FEBRERO 4150 RINCON DE...,42-5161,58,LOMA VERDE,"-58,81850307","-34,30997088",NaN
1,2,Buenos Aires,ANA SAPRIZA,PUEYRREDON Y DUPUY RUTA3 KM 52.500 S/N BÂº LO...,49-7578,61,SANTA ROSA,"-58,73073751","-34,93908311",NaN
2,3,Buenos Aires,FERNANDO LUIS SARALEGUI,CALDERON DE LA BARCA 498,49-3435,15,TORRES,"-59,12794068","-34,43082199",NaN

The table contains 10 fields

$$Compra.csv$$

In [41]:
archive_com = pd.read_csv(ruta+'/data/Compra.csv')
archive_com.head(3)

   IdCompra       Fecha  IdProducto  Cantidad  Precio  IdProveedor
0         1  2015-01-30       42832        13  560.51           12
1         2  2015-01-30       42833        11  497.58            7
2         3  2015-01-30       42834         1  588.50            6

In [42]:
archive_com.count()

IdCompra       11539
Fecha          11539
IdProducto     11539
Cantidad       11539
Precio         11539
IdProveedor    11539
dtype: int64

The table contains 6 fields

$$Empleados.csv$$

In [20]:
archive_emp = pd.read_csv(ruta+'/data/Empleado.csv', sep=';')
archive_emp.head(3)

,ID_empleado,Apellido,Nombre,Sucursal,Sector,Cargo,Salario
0,1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000.0
1,1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000.0
2,1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000.0

In [21]:
archive_emp.count()

ID_empleado    267
Apellido       267
Nombre         267
Sucursal       267
Sector         267
Cargo          267
Salario        267
dtype: int64

The table contains 7 fields

$$Gasto.csv$$

In [22]:
archive_gas = pd.read_csv(ruta+'/data/Gasto.csv')
archive_gas.head(3)

   IdGasto  IdSucursal  IdTipoGasto       Fecha    Monto
0        1          18            1  2015-01-01  1164.90
1        2          18            2  2015-01-01   317.02
2        3          18            3  2015-01-01   118.89

In [23]:
archive_gas.count()

IdGasto        8640
IdSucursal     8640
IdTipoGasto    8640
Fecha          8640
Monto          8640
dtype: int64

The table contains 5 fields

$$PRODUCTOS.csv$$

In [16]:
archive_pro = pd.read_csv(ruta+'/data/PRODUCTOS.csv', sep=';')
archive_pro.head(3)

   ID_PRODUCTO                            Concepto         Tipo   Precio
0        42737                  EPSON COPYFAX 2000    IMPRESIÓN   1658.00
1        42754    MOT ASROCK H110M-HDS S1151 S/VGA  INFORMATICA   1237.50
2        42755  MOT ASROCK A58M-VG3+ AMD FM2+ R2.0  INFORMATICA   1079.32

In [19]:
archive_pro.count()

ID_PRODUCTO    291
Concepto       291
Tipo           279
 Precio        291
dtype: int64

The table contains 4 fields

$$Proveedores.csv$$

In [29]:
archive_dor = pd.read_csv(ruta+'/data/Proveedores.csv', encoding='latin-1', sep=';')
archive_dor.head(3)

,IDProveedor,Nombre,Address,City,State,Country,departamen
0,1,NaN,BEREGUESTEIN 36,AVELLANEDA,BUENOS AIRES,ARGENTINA,AVELLANEDA
1,2,San Cirano,ALBERTI 965,CORONEL BRANDSEN,BUENOS AIRES,ARGENTINA,BRANDSEN
2,3,Bell S.A.,MORENO 331,CAMPANA,BUENOS AIRES,ARGENTINA,CAMPANA

In [25]:
archive_dor.count()

IDProveedor    14
Nombre         12
Address        14
City           14
State          14
Country        14
departamen     14
dtype: int64

The table contains 7 fields

$$Sucursales.csv$$

In [30]:
archive_suc = pd.read_csv(ruta+'/data/Sucursales.csv', sep=';')
archive_suc.head(3)

,ID,Sucursal,Direccion,Localidad,Provincia,Latitud,Longitud
0,1,Cabildo,Av. Cabildo 1342,Ciudad de Buenos Aires,Ciudad de Buenos Aires,"-34,5678060","-58,4495720"
1,2,Palermo 1,Guatemala 5701,CABA,CABA,"-34,5790350","-58,4335660"
2,3,Palermo 2,Gral. Lucio Norberto Mansilla 2668,CABA,C deBuenos Aires,"-34,5959660","-58,4051500"

In [31]:
archive_suc.count()

ID           31
Sucursal     31
Direccion    31
Localidad    31
Provincia    31
Latitud      31
Longitud     31
dtype: int64

The table contains 7 fields

$$TiposDeGasto.csv$$

In [39]:
archive_tg = pd.read_csv(ruta+'/data/TiposDeGasto.csv' ,sep=',')
archive_tg.head(3)

   IdTipoGasto Descripcion  Monto_Aproximado
0            1    Alquiler              1000
1            2   Servicios               300
2            3   Impuestos               100

In [40]:
archive_tg.count()

IdTipoGasto         4
Descripcion         4
Monto_Aproximado    4
dtype: int64

The table contains 3 fields

$$Venta.csv$$

In [43]:
archive_ven = pd.read_csv(ruta+'/data/Venta.csv')
archive_ven.head(3)

,IdVenta,Fecha,Fecha_Entrega,IdCanal,IdCliente,IdSucursal,IdEmpleado,IdProducto,Precio,Cantidad
0,1,2018-03-09,2018-03-17,3,969,13,1674,42817,813.12,2.0
1,2,2018-12-28,2018-12-29,2,884,13,1674,42795,543.18,3.0
2,3,2016-03-28,2016-03-31,2,1722,13,1674,42837,430.32,1.0

In [44]:
archive_ven.count()

IdVenta          46645
Fecha            46645
Fecha_Entrega    46645
IdCanal          46645
IdCliente        46645
IdSucursal       46645
IdEmpleado       46645
IdProducto       46645
Precio           45721
Cantidad         45753
dtype: int64

The table contains 10 fields